OpenFOAM-13/tutorials/incompressibleVoF/mixerVessel/Allmesh
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Copy mixerVessel surfaces from resources directory
cp $FOAM_TUTORIALS/resources/geometry/mixerVessel*.stl.gz constant/geometry/

# Mesh in parallel
runApplication blockMesh
runApplication surfaceFeatures
runApplication decomposePar -noFields
runParallel snappyHexMesh

# Create the sliding patches
runParallel createBaffles
runParallel splitBaffles

# Create non-conformal couples
runParallel createNonConformalCouples nonCouple1 nonCouple2

#------------------------------------------------------------------------------
